alpha_blog/app/controllers/api/v1/articles_controller.rb

SELECT "articles".* FROM "articles" ORDER BY created_at DESC
---
      def index
        articles = Article.order('created_at DESC')

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
      def show
        # byebug
        begin
          article = Article.find(params[:id])