alpha_blog/app/controllers/articles_controller.rb

SELECT  "articles".* FROM "articles" LIMIT ? OFFSET ?  [["LIMIT", 5], ["OFFSET", 0]]
SELECT COUNT(*) FROM "articles"
---
  def index
    @articles = Article.paginate(page: params[:page], per_page: 5)

UPDATE "articles" SET "title" = ?, "description" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["title", "sfsgdgdf"], ["description", "gdggsdfdngfsdfgfdgdh,jhjhgfsdgfgmh,"], ["updated_at", "2021-01-11 15:09:35.403908"], ["id", 3]]
---
  def update
    if @article.update(article_params)

INSERT INTO "articles" ("title", "description", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["title", "dsaafdgjjkhgfgh"], ["description", ".,mnbfvcscdvfbgnm,m.,,mhjkj;kljmbhnbfvd"], ["created_at", "2021-01-08 16:26:36.152068"], ["updated_at", "2021-01-08 16:26:36.152068"], ["user_id", 1]]
---
  def create
    @article = Article.new(article_params)
    @article.user = current_user
    if @article.save