alpha_blog/app/controllers/sessions_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "srijansingh@gmail.com"], ["LIMIT", 1]]
---
  def create
    # byebug
    user = User.find_by(email: params[:session][:email].downcase)