alpha_blog/app/controllers/users_controller.rb

  def create
    # byebug
    @user = User.new(user_params)
    if @user.save
---
INSERT INTO "users" ("username", "email", "created_at", "updated_at", "password_digest") VALUES (?, ?, ?, ?, ?)

  def update
    if @user.update(user_params)
---
UPDATE "users" SET "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["password_digest", "$2a$12$BkRbnJQdTXW5qwgpesxzBOpsPgitdDin9lWaomBJfKFZ954pK5Ynu"], ["updated_at", "2021-01-09 16:30:05.311135"], ["id", 3]]

  def show

    @articles = @user.articles.paginate(page: params[:page], per_page: 5)
---
SELECT  "articles".* FROM "articles" WHERE "articles"."user_id" = ? LIMIT ? OFFSET ?  [["user_id", 1], ["LIMIT", 5], ["OFFSET", 0]]
SELECT COUNT(*) FROM "articles" WHERE "articles"."user_id" = ?  [["user_id", 1]]

  def index
    @users = User.paginate(page: params[:page], per_page: 3)
---
SELECT "users".* FROM "users"
SELECT COUNT(*) FROM "users"