alpha_blog/app/controllers/users_controller.rb

SELECT  "users".* FROM "users" ORDER BY "users"."id" ASC LIMIT ?  [["LIMIT", 1]]
---
  def index
    @users = User.all