hello_app/app/controllers/articles_controller.rb

INSERT INTO "articles" ("title", "descp", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "first article"], ["descp", "sfsfsdf"], ["created_at", "2021-01-07 12:06:00.384407"], ["updated_at", "2021-01-07 12:06:00.384407"]]
---
  def create
    @article = Article.new(article_params)

    respond_to do |format|
      if @article.save

UPDATE "articles" SET "descp" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["descp", "dbghtygr-edited"], ["updated_at", "2021-01-07 12:07:11.024304"], ["id", 2]]
---
  def update
    respond_to do |format|
      if @article.update(article_params)