alpha_blog/app/views/articles/_form.html.erb

          <div class="col-10">
            <%= f.collection_select(:category_ids, Category.all, :id, :name, {prompt: "select category (can be empty)"}, {multiple: true, class: "custom-select"}) %>
---
SELECT "categories".* FROM "categories"