alpha_blog/app/views/users/index.html.erb

            </h5>
            <p class="card-text"><%= user.articles.count %> articles</p>
---
SELECT COUNT(*) FROM "articles" WHERE "articles"."user_id" = ?  [["user_id", 1]]